app/Controllers/Checkout.php

SELECT *
FROM `keranjang`
---
    public function checkout()
    {
        $keranjangModel = new keranjangModel();
        $userModel = new BuyersModel();
        $allItems = $keranjangModel->findAll();