app/Controllers/Keranjang.php

SELECT *
FROM `keranjang`
---
    public function home()
    {
        $keranjangModel = new keranjangModel();
        $keranjangItems = $keranjangModel->findAll();

DELETE FROM `keranjang`
WHERE `id_pesanan` = '1702435162'
AND `id_pesanan` = '1702435162'
---
    public function hapus($id_pesanan)
    {
        $builder = \Config\Database::connect()->table('keranjang')->where('id_pesanan', $id_pesanan);
        $builder->delete(['id_pesanan' => $id_pesanan]);

SELECT *
FROM `keranjang`
WHERE `keranjang`.`id_pesanan` = '1702435160'
---
    public function edit()
    {
        // $idPesanan = $this->request->getPost('id');
        // $builder = \Config\Database::connect()->table('keranjang')->where('id_pesanan', $idPesanan);
        $keranjangModel = new keranjangModel();
        $idPesanan = $this->request->getPost('id');
        $keranjangItems = $keranjangModel->find($idPesanan);

UPDATE `keranjang` SET `jumlah_pesanan` = '13', `total_harga` = 260000
WHERE `id_pesanan` = '1702435160'
---
    public function update()
    {
        $keranjangModel = new keranjangModel();
        $id = $this->request->getPost('id_hidden');
        $builder = \Config\Database::connect()->table('keranjang')->where('id_pesanan', $id);
        $jumlahBaru = $this->request->getPost('jumlah_pesanan');
        $pesananById = $keranjangModel->find($id);
        $harga = $pesananById['harga_produk'];

        $totalHargaBaru = $harga * $jumlahBaru;

        $data = [
            'jumlah_pesanan' => $jumlahBaru,
            'total_harga' => $totalHargaBaru
        ];
        $builder->update($data);

SELECT *
FROM `keranjang`
---
    public function precheckout()
    {
        $keranjangModel = new keranjangModel();

        $allItems = $keranjangModel->findAll();

SELECT *
FROM `keranjang`
INSERT INTO `buyers` (`sub_total`, `nama_depan`, `nama_belakang`, `email`, `no_telephone`, `address`, `token`, `order_id`) VALUES ('310000', 'Bryan', 'Okta', 'bryanadherson@gmail.com', '081615954175', 'kendal, sragi', '44d76ac0-ce15-41c9-95b1-112583c91fed', '314012649')
---
    public function checkout()
    {
        $userModel = new BuyersModel();
        $keranjangModel = new keranjangModel();
        $allItems = $keranjangModel->findAll();
        $data = [
            'sub_total' => $this->request->getPost('sub_total'),
            'items' => $allItems,
            'nama_depan' => $this->request->getPost('nama_depan'),
            'nama_belakang' => $this->request->getPost('nama_belakang'),
            'email' => $this->request->getPost('email'),
            'no_telephone' => $this->request->getPost('no_telephone'),
            'address' => $this->request->getPost('address'),
            'token' => $this->request->getPost('token'),
            'order_id' => $this->request->getPost('order_id')
        ];
        $userModel->save($data);