app/Controllers/Pemesanan.php

    public function home()
    {

        $buyersModel = new BuyersModel();
        $pesanan = $buyersModel->findAll();
---
SELECT *
FROM `buyers`